Repository: TakehiroShinzawa/ResourceMaker
Catalog: Resources/Strings.*.resx
Languages: fr_fr, ja_jp, ko_kr, zh_cn

# ResourceizeText
source: Localize
fr_fr: Ressourcisation
ja_jp: リソース化
ko_kr: 리소스화
zh_cn: 资源化

# LabelTargetText.Text
source: Source Text
fr_fr: Texte cible
ja_jp: 対象テキスト
ko_kr: 대상 텍스트
zh_cn: 目标文本

# LabelUpdatedText.Text
source: Replacement Text
fr_fr: Texte réécrit
ja_jp: 書き戻しテキスト
ko_kr: 되쓰기 텍스트
zh_cn: 回写文本

# OriginalText.Text
source: Original Text
fr_fr: Texte original
ja_jp: 元テキスト
ko_kr: 원본 텍스트
zh_cn: 原始文本

# ResourceKey.Text
source: Enter resource name
fr_fr: Entrez le nom de la ressource
ja_jp: リソース名を入力
ko_kr: 리소스 이름을 입력하세요
zh_cn: 请输入资源名称

# ResourceGetterExpression.Content
source: Get Expr.
ko_kr: 식 가져오기
zh_cn: 获取表达式

# Feedback.Content
source: Write Back
fr_fr: Réécrire
ja_jp: 書き戻す
ko_kr: 되쓰기
zh_cn: 回写

# SaveResource.Content
source: Apply Changes
fr_fr: Appliquer
ja_jp: 反映
ko_kr: 반영
zh_cn: 应用

# SaveAndClose.Content
source: Save Resource
fr_fr: Enregistrer
ja_jp: 保存
ko_kr: 저장
zh_cn: 保存

# AddLanguage.Content
source: Add Language
fr_fr: Ajouter une langue
ja_jp: 言語の追加
ko_kr: 언어 추가
zh_cn: 添加语言

# SelectLanguagesGuide.Text
source: Select the languages you want to use
fr_fr: Veuillez sélectionner la langue à utiliser
ja_jp: 使用したい言語を選択してください
ko_kr: 사용할 언어를 선택하세요
zh_cn: 请选择要使用的语言

# AdditionalLanguageCode.Text
source: Add a language code (e.g., it‑IT)
fr_fr: Code langue supplémentaire (ex : it-IT)
ja_jp: 追加言語コード（例: it-IT）
ko_kr: 추가 언어 코드 (예: it-IT)
zh_cn: 附加语言代码（例如：it-IT）

# LoaderDeclaration
source: I’ve sent the loader declaration to the clipboard.
fr_fr: Déclaration du loader copiée dans le presse-papiers
ja_jp: loaderの宣言をクリップボードに送りました
ko_kr: loader 선언이 클립보드에 복사되었습니다
zh_cn: 已将 loader 声明复制到剪贴板

# ClearCache.Content
source: Clear cache
fr_fr: Vider le cache
ja_jp: キャッシュをクリア
ko_kr: 캐시 지우기
zh_cn: 清除缓存

# ProjectSelector.Text
source: Please select a project type.
fr_fr: Veuillez sélectionner un type de projet.
ja_jp: プロジェクトタイプを選択してください
ko_kr: 프로젝트 유형을 선택하세요.
zh_cn: 请选择项目类型。

# BtnCreate.Content
source: Create
fr_fr: Créer
ja_jp: 作成
ko_kr: 만들기
zh_cn: 创建

# BtnCancel.Content
source: Cancel
fr_fr: Annuler
ja_jp: キャンセル
ko_kr: 취소
zh_cn: 取消

# BtnClose.Content
source: Close
fr_fr: Fermer
ja_jp: 閉じる
ko_kr: 닫기
zh_cn: 关闭

# BtnAdd.Content
source: Add
fr_fr: Ajouter
ja_jp: 追加
ko_kr: 추가
zh_cn: 添加

# BtnCreateToolTip
source: Create language files for checked items. Skip if already existing.
fr_fr: Créez les fichiers de langue cochés. Ignorer s’ils existent déjà.
ja_jp: チェックの付いている言語ファイルを作成します。既存の場合はスキップします。
ko_kr: 체크된 항목의 언어 파일을 생성합니다. 기존 파일은 건너뜁니다.
zh_cn: 创建已勾选项的语言文件。若已存在则跳过。

# BtnCancelToolTip
source: Cancel without adding language files or editing resources.
fr_fr: Annuler sans ajouter de fichiers de langue ni modifier les ressources.
ja_jp: 言語ファイルを追加しません。リソースの編集を行いません。
ko_kr: 언어 파일 추가나 리소스 편집 없이 취소합니다.
zh_cn: 取消操作，不添加语言文件，也不编辑资源。

# BtnCloseToolTip
source: Close the language window, then edit the resources.
fr_fr: Fermez la fenêtre de langue, puis modifiez les ressources.
ja_jp: 言語ウィンドウを閉じます。その後、リソースの編集を行います。
ko_kr: 언어 창을 닫은 후 리소스를 편집합니다.
zh_cn: 关闭语言窗口后，编辑资源。

# BtnAddToolTip
source: Add a resource language. You can also press Enter to add it.
fr_fr: Ajoutez une langue de ressource. Vous pouvez aussi appuyer sur Entrée.
ja_jp: リソース言語を追加します。エンターキーでも追加できます。
ko_kr: 리소스 언어를 추가합니다. Enter 키로도 추가할 수 있습니다.
zh_cn: 添加资源语言。也可以按 Enter 键进行添加。

# ResultTextToolTip
source: Replaces the selected line.
fr_fr: Remplace la ligne sélectionnée.
ja_jp: 選択した行と置き換えられます。
ko_kr: 선택한 행으로 대체됩니다.
zh_cn: 将替换所选行。

# BaseTextsToolTip
source: Select the text to be resourced. If a resource key is shown, the registered value will be displayed.
fr_fr: Sélectionnez le texte à convertir en ressource. Si une clé est affichée, la valeur enregistrée s’affichera.
ja_jp: リソース化対象のテキストを選んでください。 リソースキーを表示している時は登録済みの値が表示されます。
ko_kr: 리소스로 등록할 텍스트를 선택하세요. 리소스 키가 표시되면 등록된 값이 표시됩니다.
zh_cn: 请选择要资源化的文本。 显示资源键时，将显示已注册的值。

# ResourceKeyToolTip
source: Enter the key name. In XAML, it will be defined as 'KeyName.TargetName'. Do not change the target name.
fr_fr: Saisissez le nom de la clé. Dans XAML, il sera défini comme 'NomClé.NomCible'. Ne modifiez pas le nom cible.
ja_jp: キー名を入力してください。 xaml編集時は、'キー名.対象名'を定義しますが、対象名は変更しないでください。
ko_kr: 请输入键名。在 XAML 中将定义为“键名.目标名”。请勿更改目标名。
zh_cn: キー名を入力してください。xaml編集時は、'キー名.対象名'を定義しますが、対象名は変更しないでください。

# ResourceGetterBoxToolTip
source: This code is auto-generated, but the retrieval method (loader.GetString) can be customized.
fr_fr: Ce code est généré automatiquement, mais la méthode d’accès (loader.GetString) est personnalisable.
ja_jp: このコードは自動生成されますが、取得メソッド(loader.GetString)はカスタマイズ可能です
ko_kr: 이 코드는 자동 생성되지만, 가져오기 메서드(loader.GetString)는 사용자 정의할 수 있습니다.
zh_cn: 此代码为自动生成，但获取方法（loader.GetString）可自定义。

# FeedbackToolTip
source: If checked, the source text will be written back after creating the resource.
fr_fr: Si la case est cochée, le texte source sera réécrit après la création de la ressource.
ja_jp: チェックされている場合、リソース作成後にソーステキストを書き戻します。
ko_kr: 체크되어 있으면, 리소스를 생성한 후 소스 텍스트가 다시 작성됩니다.
zh_cn: 如果已选中，在创建资源后将回写源文本。

# SaveResourceToolTip
source: Saves the resource being edited to cache. You can continue editing.
fr_fr: Enregistre la ressource en cours dans le cache. Vous pouvez continuer la modification.
ja_jp: 編集中のリソースをキャッシュに保存します。引き続き編集を行えます。
ko_kr: 편집 중인 리소스를 캐시에 저장합니다. 계속 편집할 수 있습니다.
zh_cn: 将正在编辑的资源保存到缓存中。可继续编辑。

# SaveAndCloseToolTip
source: Applies the edited resource globally. Ends editing and closes the window.
fr_fr: Applique la ressource modifiée à l’ensemble. Termine l’édition et ferme la fenêtre.
ja_jp: 編集リソースを全体に反映します。編集を終了しウィンドウを閉じます。
ko_kr: 편집된 리소스를 전체에 반영합니다. 편집을 종료하고 창을 닫습니다.
zh_cn: 将编辑的资源应用到全体。结束编辑并关闭窗口。

# AddLanguageToolTip
source: Add or remove language resources. The window will close after applying the settings.
fr_fr: Ajoutez ou supprimez des ressources linguistiques. La fenêtre se fermera après l’application des paramètres.
ja_jp: 言語リソースの追加・削除を行います。設定後このウィンドウも閉じます。
ko_kr: 언어 리소스를 추가하거나 삭제합니다. 설정 적용 후 창이 닫힙니다.
zh_cn: 添加或删除语言资源。设置完成后将关闭窗口。

# ClearCacheToolTip
source: Clears cached data. Be sure to press this if resources were edited externally.
fr_fr: Efface les données en cache. Veuillez appuyer ici si les ressources ont été modifiées en externe.
ja_jp: 保持データをクリアします。外部でリソースを編集した時は、必ず押下してください。
ko_kr: 캐시된 데이터를 지웁니다. 외부에서 리소스를 편집한 경우 반드시 눌러주세요.
zh_cn: 清除缓存数据。如在外部编辑了资源，请务必点击此按钮。

# ApplyButton.Content
source: Apply
fr_fr: Valider
ja_jp: 決定
ko_kr: 적용
zh_cn: 应用

# BtnCsvOut.Content
source: CSV Export
fr_fr: Export CSV
ja_jp: CSV出力
ko_kr: CSV 내보내기
zh_cn: 导出 CSV

# BtnMakeLoaderCode.Content
source: Export Loader Code
fr_fr: Exporter le code du chargeur
ja_jp: ローダーコードの出力
ko_kr: 로더 코드 내보내기
zh_cn: 导出加载器代码

# BtnMakeLoaderCodeToolTip
source: Writes the loader code for UI language resources to ResourceAdder.cs
fr_fr: Écrit le code de chargement des ressources linguistiques dans ResourceAdder.cs
ja_jp: 画面用言語リソースのローダーコードを、ResourceAdder.cs に書き込みます
ko_kr: 화면 언어 리소스 로더 코드를 ResourceAdder.cs에 작성합니다
zh_cn: 将界面语言资源的加载器代码写入 ResourceAdder.cs 文件

# MessageResourceFileNotFound
source: Resource settings have changed. The expected resource file could not be found.
fr_fr: Les paramètres de ressource ont été modifiés. Le fichier de ressource attendu est introuvable.
ja_jp: リソース設定が変更されました。 想定されるリソースファイルが見つかりませんでした。
ko_kr: 리소스 설정이 변경되었습니다. 예상된 리소스 파일을 찾을 수 없습니다.
zh_cn: 资源设置已更改。 未找到预期的资源文件。

# TitleResourceRetrievalFailed
source: Resource Retrieval Failed
fr_fr: Échec de récupération des ressources
ja_jp: リソース取得失敗
ko_kr: 리소스 가져오기 실패
zh_cn: 资源获取失败

# MessageTooltipConflict
source: The tooltip value overlaps with another property and cannot be localized. Please place it on a separate line from other properties.
fr_fr: L'emplacement de définition de l'infobulle chevauche d'autres propriétés, ce qui empêche sa conversion en ressource. Veuillez la placer sur une ligne distincte.
ja_jp: ツールチップの定義位置が他のプロパティと重複しているため、リソース化できません。 他のプロパティとは別の行に分けて記述してください。
ko_kr: 툴팁 값이 다른 속성과 중복되어 리소스화할 수 없습니다. 다른 속성과는 별도의 줄에 작성해 주세요.
zh_cn: 工具提示的值与其他属性重复，无法进行资源化。 请将其与其他属性分开写在不同的行上。

# TitleTooltipConflict
source: Tooltips Are a Bit Special
fr_fr: Les info-bulles sont un peu spéciales
ja_jp: ツールチップは特殊なの
ko_kr: 툴팁은 좀 특별해요
zh_cn: 工具提示有点特别哦

# TitleResourceEditingMode
source: Resource Editing Mode
fr_fr: Mode d’édition des ressources
ja_jp: リソース編集モード
ko_kr: 리소스 편집 모드
zh_cn: 资源编辑模式

# MessageGenerateResourceCode
source: Code for loading all language resources will be generated. The contents of 'ResourceAdder.cs' will be overwritten.
fr_fr: Le code de chargement de toutes les ressources linguistiques sera généré. Le contenu de 'ResourceAdder.cs' sera remplacé.
ja_jp: 全ての言語リソースのロード用コードを書き出します。 'ResourceAdder.cs'の内容は書き換えられます。
ko_kr: 모든 언어 리소스를 로드하는 코드가 생성됩니다. 'ResourceAdder.cs'의 내용이 덮어쓰기됩니다.
zh_cn: 将生成用于加载所有语言资源的代码。 'ResourceAdder.cs' 的内容将被覆盖。

# TitleGenerateResourceCode
source: Overwrite Confirmation
fr_fr: Confirmation d’écrasement
ja_jp: 上書き確認
ko_kr: 덮어쓰기 확인
zh_cn: 覆盖确认

# MessageResourceAdderOutputError
source: An error occurred while generating ResourceAdder.cs. {0}
fr_fr: Une erreur s’est produite lors de la génération de ResourceAdder.cs. {0}
ja_jp: ResourceAdder.csの出力中にエラーが発生しました。 {0}
ko_kr: ResourceAdder.cs를 생성하는 중 오류가 발생했습니다. {0}
zh_cn: 生成 ResourceAdder.cs 时发生错误。 {0}

# TitleFileWriteError
source: File Write Error
fr_fr: Erreur d’écriture de fichier
ja_jp: ファイル書き込みエラー
ko_kr: 파일 쓰기 오류
zh_cn: 文件写入错误

# MessageConfirmKeyDeletionAllLanguages
source: Do you want to delete the key '{0}' from all language resources?
fr_fr: Voulez-vous supprimer la clé « {0} » de toutes les ressources linguistiques ?
ja_jp: 指定されたキー '{0}' をすべての言語リソースから削除しますか？
ko_kr: 모든 언어 리소스에서 키 '{0}'를 삭제하시겠습니까?
zh_cn: 是否要从所有语言资源中删除键“{0}”？

# TitleConfirmResourceDeletion
source: Delete
fr_fr: Suppression
ja_jp: 削除
ko_kr: 삭제
zh_cn: 删除

# NoteOutputToResourceAdder
source: Will be output to ResourceAdder.cs
fr_fr: Sera exporté vers ResourceAdder.cs
ja_jp: ResourceAdder.csに出力されます
ko_kr: ResourceAdder.cs로 출력됩니다
zh_cn: 将输出到 ResourceAdder.cs

# BtnClickme
source: Click me
fr_fr: Cliquez pour copier
ko_kr: 클릭하여 복사
zh_cn: 点击复制

# ManageLanguage.Content
source: Manage resources
fr_fr: Gérer les ressources
ja_jp: リソースの管理
ko_kr: 리소스 관리
zh_cn: 资源管理

# ResSeparatedByFolder
source: {0} (separated by folder)
fr_fr: {0} (séparé par dossier)
ja_jp: {0} (フォルダで分離)
ko_kr: {0} (폴더로 분리됨)
zh_cn: {0}（按文件夹分隔）

# ResIntoFilename
source: {0} (inserted into filename)
fr_fr: {0} (inséré dans le nom de fichier)
ja_jp: {0} (ファイル名に挿入)
ko_kr: {0} (파일 이름에 삽입됨)
zh_cn: {0}（插入文件名）

# MissingResource_enUS
source: Resource for en-US not found
fr_fr: La ressource en-US est introuvable
ja_jp: en-US のリソースが見つかりません
ko_kr: en-US 리소스를 찾을 수 없습니다
zh_cn: 未找到 en-US 的资源

# NoLanguageSelected
source: No output target
fr_fr: Aucun élément de sortie
ja_jp: 出力対象未選択
ko_kr: 출력 대상 없음
zh_cn: 无输出对象

# NoLanguageSelection
source: Please select a language to export
fr_fr: Veuillez sélectionner une langue à exporter
ja_jp: 出力する言語を選択してください。
ko_kr: 내보낼 언어를 선택하세요
zh_cn: 请选择要导出的语言

# CsvExportSuccess
source: CSV has been exported
fr_fr: Le fichier CSV a été exporté
ja_jp: CSVを出力しました。
ko_kr: CSV가 출력되었습니다
zh_cn: 已导出 CSV 文件

# CsvExportCompleted
source: Export complete
fr_fr: Exportation terminée
ja_jp: 出力完了
ko_kr: 출력 완료
zh_cn: 导出完成

# SelectCsvExportSettings
source: Please select CSV export settings
fr_fr: Veuillez sélectionner les paramètres d’exportation CSV
ja_jp: CSVの出力条件を選択してください。
ko_kr: CSV 출력 설정을 선택하세요
zh_cn: 请选择 CSV 导出条件

# MissingCsvExportSettings
source: Export settings missing
fr_fr: Paramètres d’exportation manquants
ja_jp: 出力条件未設定
ko_kr: 출력 설정 누락
zh_cn: 未设置导出条件

# SelectSingleLanguageForImport
source: Please select one language to import
fr_fr: Veuillez sélectionner une seule langue à importer
ja_jp: 取込む言語を一つ選択してください。
ko_kr: 하나의 언어만 선택하여 가져오세요
zh_cn: 请选择一个要导入的语言

source: Language selection required
fr_fr: Sélection de langue requise
ja_jp: 言語選択が必要です
ko_kr: 언어 선택이 필요합니다
zh_cn: 需要选择语言

# InvalidCultureCodeEntered
source: The culture code is invalid
fr_fr: Le code culture est invalide
ja_jp: カルチャコードが正しくありません。
ko_kr: 문화 코드가 올바르지 않습니다
zh_cn: 区域代码无效

# InvalidCultureCode
source: Culture code error
fr_fr: Erreur de code culture
ja_jp: カルチャコードエラー
ko_kr: 문화 코드 오류
zh_cn: 区域代码错误

# NoTextInClipboard
source: No text found in clipboard
fr_fr: Aucun texte trouvé dans le presse-papiers
ja_jp: クリップボードにテキストが在りません。
ko_kr: 클립보드에 텍스트가 없습니다
zh_cn: 剪贴板中未找到文本内容

source: Clipboard empty
fr_fr: Presse-papiers vide
ja_jp: 空クリップボード
ko_kr: 클립보드 비어 있음
zh_cn: 剪贴板为空

source: Select CSV file
fr_fr: Sélectionner le fichier CSV
ja_jp: CSVファイルを選択
ko_kr: CSV 파일 선택
zh_cn: 选择 CSV 文件

# CsvFileFilter
source: CSV file (*.csv)|*.csv
fr_fr: Fichier CSV (*.csv)|*.csv
ja_jp: CSVファイル (*.csv)|*.csv
ko_kr: CSV 파일 (*.csv)|*.csv
zh_cn: CSV 文件 (*.csv)|*.csv

# NoCultureCodeDetectedInFile
source: No culture code detected in the file
fr_fr: Aucun code culture détecté dans le fichier
ja_jp: ファイルからカルチャコードを識別できませんでした
ko_kr: 파일에서 문화 코드를 식별할 수 없습니다
zh_cn: 无法从文件中识别区域代码

source: Culture code not found
fr_fr: Code culture introuvable
ja_jp: カルチャコード未検出
ko_kr: 문화 코드 없음
zh_cn: 区域代码未找到

# LanguageResourceAddedToTarget
source: Language resource(s) {0} have been added
fr_fr: Les ressources linguistiques {0} ont été ajoutées
ja_jp: 言語リソース{0}を追加しました。
ko_kr: 언어 리소스 {0}이(가) 추가되었습니다
zh_cn: 已添加语言资源 {0}

source: Language resource added
fr_fr: Ressource linguistique ajoutée
ja_jp: 言語リソース追加
ko_kr: 언어 리소스 추가됨
zh_cn: 已添加语言资源

# TargetCountMismatchWithDefinitions
source: The number of targets does not match the current definition count
fr_fr: Le nombre de cibles ne correspond pas au nombre de définitions actuel
ja_jp: 対象が現在の定義数と異なっています。
ko_kr: 대상 수가 현재 정의 수와 일치하지 않습니다
zh_cn: 对象数量与当前定义数量不一致

source: Unable to retrieve
fr_fr: Impossible d’obtenir
ja_jp: 取得不能
ko_kr: 가져올 수 없음
zh_cn: 无法获取

# SelectLanguageForRelocation
source: Please select a language to relocate
fr_fr: Veuillez sélectionner une langue à réaffecter
ja_jp: 再配置する言語を選択してください。
ko_kr: 재배치할 언어를 선택하세요
zh_cn: 请选择要重新配置的语言

# LanguageRelocationRequired
source: No language selected
fr_fr: Aucune langue sélectionnée
ja_jp: 言語未選択
ko_kr: 언어가 선택되지 않았습니다
zh_cn: 未选择语言

# RelocationRootFolderNotSet
source: The relocation root folder has not been set
fr_fr: Le dossier racine de réaffectation n’a pas été défini
ja_jp: 再配置ルートフォルダが設定されていません。
ko_kr: 재배치 루트 폴더가 설정되지 않았습니다
zh_cn: 尚未设置重新配置根文件夹

# RelocationRootFolderDoesNotExist
source: The relocation root folder does not exist
fr_fr: Le dossier racine de réaffectation n’existe pas
ja_jp: 再配置ルートフォルダが存在しません
ko_kr: 재배치 루트 폴더가 존재하지 않습니다
zh_cn: 重新配置根文件夹不存在

# InvalidRelocationFolderName
source: The relocation resource folder name is invalid
fr_fr: Le nom du dossier de réaffectation est invalide
ja_jp: 再配置リソースフォルダ名が不正です。
ko_kr: 재배치 리소스 폴더 이름이 잘못되었습니다
zh_cn: 重新配置资源文件夹名称无效

# InvalidRelocationFileName
source: The relocation resource file name is invalid
fr_fr: Le nom du fichier de réaffectation est invalide
ja_jp: 再配置リソースファイル名が不正です
ko_kr: 재배치 리소스 파일 이름이 잘못되었습니다
zh_cn: 重新配置资源文件名称无效

# RelocationFormatNotSelected
source: No relocation resource format has been selected
fr_fr: Aucun format de ressource de réaffectation n’a été sélectionné
ja_jp: 再配置リソース形式が未選択です。
ko_kr: 재배치 리소스 형식이 선택되지 않았습니다
zh_cn: 未选择重新配置资源格式

source: Relocation definition error
fr_fr: Erreur de définition de réaffectation
ja_jp: 再配置定義エラー
ko_kr: 재배치 정의 오류
zh_cn: 重新配置定义错误

# RelocationErrorOccurred
source: An error occurred during relocation. {0}
ja_jp: 再配置中にエラーが発生しました。 {0}
ko_kr: 재배치 중 오류가 발생했습니다. {0}
zh_cn: 重新配置过程中发生错误。 {0}

source: Relocation runtime error
fr_fr: Erreur d’exécution de réaffectation
ja_jp: 再配置実行時エラー
ko_kr: 재배치 실행 오류
zh_cn: 重新配置运行时错误

# ChkCustom.Content
source: Custom settings
fr_fr: Paramètres personnalisés
ja_jp: カスタム設定
ko_kr: 사용자 설정
zh_cn: 自定义设置

# CustomResFolder.Text
source: Resource folder ./
fr_fr: Dossier de ressources ./
ja_jp: リソースフォルダ ./
ko_kr: 리소스 폴더 ./
zh_cn: 资源文件夹 ./

# CustmResourceName.Text
source: Resource file name (no extension)
fr_fr: Nom du fichier de ressource (sans extension)
ja_jp: リソースファイル名(拡張子不要)
ko_kr: 리소스 파일 이름 (확장자 제외)
zh_cn: 资源文件名称（无需扩展名）

# CustomResPtn.Text
source: Resource pattern
fr_fr: Modèle de ressource
ja_jp: リソースパターン
ko_kr: 리소스 패턴
zh_cn: 资源模式

# ChkResw.Content
source: resw (separated by folder)
fr_fr: resw (séparé par dossier)
ja_jp: resw (フォルダで分離)
ko_kr: resw (폴더로 분리)
zh_cn: resw（按文件夹分离）

# ChkResx.Content
source: resx (inserted into file name)
fr_fr: resx (inséré dans le nom de fichier)
ja_jp: resx (ファイル名に挿入)
ko_kr: resx (파일 이름에 삽입)
zh_cn: resx（插入文件名中

# IsNewResource.Text
source: (Create new)
fr_fr: (Créer nouveau)
ja_jp: (新規作成)
ko_kr: (새로 만들기)
zh_cn: （新建）

# BtnSelectAllLanguage.Content
source: Select all
fr_fr: Tout sélectionner
ja_jp: 全て選択
ko_kr: 모두 선택
zh_cn: 全选

# CsvOutputItem.Text
source: CSV output item:
fr_fr: Élément à exporter en CSV :
ja_jp: CSV出力項目：
ko_kr: CSV 출력 항목:
zh_cn: CSV 输出项：

# optVOnly.Content
source: Key only
fr_fr: Clé uniquement
ja_jp: キーのみ
ko_kr: 키만
zh_cn: 仅键

# optKOnly.Content
source: Value only
fr_fr: Valeur uniquement
ja_jp: 値のみ
ko_kr: 값만
zh_cn: 仅值

# optKVP.Content
source: Key and value
fr_fr: Clé et valeur
ja_jp: キーと値
ko_kr: 키와 값
zh_cn: 键和值

# CsvOutputPath.Text
source: Select output destination:
fr_fr: Sélectionner la destination de sortie :
ja_jp: 出力先を選択：
ko_kr: 출력 위치 선택:
zh_cn: 选择输出位置：

# RBSameFolder.Content
source: Same folder
fr_fr: Dossier identique
ja_jp: 同じフォルダ
ko_kr: 동일 폴더
zh_cn: 相同文件夹

# RBPrjTop.Content
source: Project root
fr_fr: Racine du projet
ja_jp: プロジェクトトップ
ko_kr: 프로젝트 루트
zh_cn: 项目根目录

# RBClipboard.Content
source: Clipboard
fr_fr: Presse-papiers
ja_jp: クリップボード
ko_kr: 클립보드
zh_cn: 剪贴板

# ChkWithHeader.Content
source: Merge into single file
fr_fr: Fusionner dans un seul fichier
ja_jp: 一つのファイルにまとめる
ko_kr: 하나의 파일로 병합
zh_cn: 合并为一个文件

# ChkWithHeaderToolTip
source: Adds a header row when checked
fr_fr: "Key" et les codes de culture seront utilisés comme en-têtes.
ja_jp: "Key"及び、カルチャコードがヘッダーになります。
ko_kr: 체크하면 헤더 행이 추가됩니다
zh_cn: 选中后将添加标题行

# GetCsv.Content
source: Import CSV
fr_fr: Importer CSV
ja_jp: CSV取り込み
ko_kr: CSV 가져오기
zh_cn: 导入 CSV

# ImportFromClipboard.Content
source: Import from clipboard
fr_fr: Importer depuis le presse-papiers
ja_jp: クリップボードから取り込み
ko_kr: 클립보드에서 가져오기
zh_cn: 从剪贴板导入

# ClipLangCodeToolTip
source: Enter the culture code to import as.
fr_fr: Saisissez le code de culture à importer.
ja_jp: 読み込み対象のカルチャーコードを入れてください。
ko_kr: 가져올 대상의 문화 코드를 입력하세요.
zh_cn: 请输入要导入的区域代码。

# LblCultureCode.Text
source: Culture Code
fr_fr: Code de culture
ja_jp: カルチャコード
ko_kr: 문화 코드
zh_cn: 文化代码

# RelocateGroup.Header
source: Resource Relocation
fr_fr: Réaffectation des ressources
ja_jp: リソース再配置
ko_kr: 리소스 재배치
zh_cn: 资源重新配置

# LblCurrentResource.Text
source: Current Resource
fr_fr: Ressource actuelle
ja_jp: 現在のリソース
ko_kr: 현재 리소스
zh_cn: 当前资源

# LblResourceFolder.Text
source: Resource Folder
fr_fr: Dossier de ressources
ja_jp: リソースフォルダ
ko_kr: 리소스 폴더
zh_cn: 资源文件夹

# LblResourceName.Text
source: Resource Name
fr_fr: Nom de ressource
ja_jp: リソース名
ko_kr: 리소스 이름
zh_cn: 资源名称

# LblFileFormat.Text
source: File Format
fr_fr: Format de fichier
ja_jp: ファイル形式
ko_kr: 파일 형식
zh_cn: 文件格式

# LblRelocatedResource.Text
source: Relocated Resource
fr_fr: Ressource réaffectée
ja_jp: 再配置先リソース
ko_kr: 재배치된 리소스
zh_cn: 重新配置的资源

# LblRelResourceFolder.Text
source: Resource Folder
fr_fr: Dossier de ressources
ja_jp: リソースフォルダ
ko_kr: 리소스 폴더
zh_cn: 资源文件夹

# LblRelResourceName.Text
source: Resource Name
fr_fr: Nom de ressource
ja_jp: リソース名
ko_kr: 리소스 이름
zh_cn: 资源名称

# FileFormatResx.Content
source: RESX Format (.resx)
fr_fr: Format RESX (.resx)
ja_jp: RESX形式（.resx）
ko_kr: RESX 형식 (.resx)
zh_cn: RESX格式（.resx）

# FileFormatResw.Content
source: RESW Format (.resw)
fr_fr: Format RESW (.resw)
ja_jp: RESW形式 (.resw)
ko_kr: RESW 형식 (.resw)
zh_cn: RESW格式（.resx）

# LblRelocationProjectFolder.Text
source: Relocation Project Folder
fr_fr: Dossier de projet de réaffectation
ja_jp: 再配置プロジェクトフォルダ
ko_kr: 재배치 프로젝트 폴더
zh_cn: 重新配置项目文件夹

# BtnBrowseFolder.Content
source: Browse...
fr_fr: Parcourir...
ja_jp: 参照...
ko_kr: 찾아보기...
zh_cn: 浏览...

# BtnRelocateResource.Content
source: Execute Relocation
fr_fr: Exécuter la réaffectation
ja_jp: 配置変更を実行
ko_kr: 재배치 실행
zh_cn: 执行重新配置

# LblSelectFolder.Title
source: Select Folder
fr_fr: Sélectionner un dossier
ja_jp: フォルダを選択
ko_kr: 폴더 선택
zh_cn: 选择文件夹

# BtnMoveUpFolder.Content
source: ↑ Up
fr_fr: ↑ Monter
ja_jp: ↑ 上へ
ko_kr: ↑ 위로
zh_cn: ↑ 上一级

# BtnCancelFolderSelection.Content
source: Cancel
fr_fr: Annuler
ja_jp: キャンセル
ko_kr: 취소
zh_cn: 取消

# BtnConfirmFolderSelection.Content
source: Select
fr_fr: Sélectionner
ja_jp: 選択
ko_kr: 선택
zh_cn: 选择

# LblRelFileFormat.Text
source: File Format
fr_fr: Format de fichier
ja_jp: ファイル形式
ko_kr: 파일 형식
zh_cn: 文件格式

# ResourceGetterExpressionToolTip
source: Copies the resource loader declaration to the clipboard
ko_kr: 리소스 로더 선언을 클립보드에 복사합니다
zh_cn: 将资源加载器的声明复制到剪贴板

# LanguageSelectionWindowName
source: Language Manager
fr_fr: Gestionnaire de langues
ja_jp: 言語マネージャー
ko_kr: 언어 관리자
zh_cn: 语言管理器

# LblResourceWindow
source: Resource Management
fr_fr: Gestion des ressources
ja_jp: リソース管理
ko_kr: 리소스 관리
zh_cn: 资源管理

# HelpLinkText.Text
source: Open Help Page
fr_fr: Ouvrir la page d’aide
ja_jp: ヘルプページを開く
ko_kr: 도움말 페이지 열기
zh_cn: 打开帮助页面

# HelpLinkLangToolTip
source: Only Japanese is available for now.
fr_fr: Seul le japonais est disponible pour le moment.
ja_jp: 日本語ページです
ko_kr: 현재는 일본어만 제공됩니다.
zh_cn: 目前仅提供日语。
